<?php


return [
    //修改密码
    'passwordInfo'=>[
        '1' => '密码修改',
        '0' => '密码设置',
    ],
    // 账户类型
    'financeType' =>[
        '1' => '余额',
        '2' => '金豆',
        '3' => '店铺账户',
        '4' => '积分',
        '5' => '购物券',
    ],
    // 账户对应字段
    'financeField' =>[
        '1' => 'balance',
        '2' => 'otayonii',
        '3' => 'shop_money',
        '4' => 'point',
        '5' => 'coupon',
    ],
    // mb345 短信 账号密码
    'mb345'=>[
        // sms_username
        'sms_username' => 'LKSDK0004892',

        // sms_password
        'sms_password' => 'jkwqm814@',
        //短信签名
        'sms_signature'=>'【ISCM】',
    ],

    'bonus'=>[
        // 奖金结算推荐比例(购物)
        'recommendRatio'=>[
            '1' => 0.025,  // 第一代
            '2' => 0.015,  // 第二代
        ],
        // 极差结算(购物)
        'rangeRatio'=>[
            '2' => 0.05,  // 县级
            '3' => 0.075, // 市级
            '4' => 0.1,   // 省级
        ],
        // 店铺增加比例
        'shopRatio' => [
            '0' => 0.8,  // 个人店铺
            '1' => 0.9,  // 企业店铺
        ],
        // 积分账户比例
        'pointRatio' =>[
            '0'=> 0.1, // 个人店铺
            '1'=> 0.2, // 企业店铺
            'public'=>2.5 // 统一用到
        ],
        'name' => [
            '1' => '推荐奖',
            '2' => '极差奖',
        ],

    ],


    'appripriate' =>[
        '1' => '拨款',
        '2' => '扣款',
    ],

    'shopOtayonii' => [
        'type' => [
            '2' => '退款',
            '4' => '提现',
            '8' => '拨款',
            '9' => '扣款',
            '12'=> '转账',
            '13'=> '购物',
            '14'=> '兑换',
            '16'=>'售出',
        ],
    ],
    // 买入卖出
    'business' => [
        'tax'    => 0.1,
        'status' =>[
            '1' => '未匹配',
            '2' => '部分匹配',
            '3' => '完成匹配',
        ]
    ],

    // 图标
    'iconfont'=>[
        'Business'=>'gavel',
        'Shop'    =>'university',
        'Goods'   => 'laptop',
        'User'    => 'user',
        'Order'   => 'building-o',
        'Notice'  => 'paper-plane',
        'Promotion'=>'bullhorn',
        'BillPayments'=>'money',
        'Setting'=>'television',
        'Report' => 'line-chart',
        'Wechat'=>'wechat',
        'Form'=>'file-text',
    ],
    // 清空表
    'cleanTable'=>[
        'jshop_appropriate'=>'拨款记录',
        'jshop_ranking'    => '排行榜',

        'jshop_balance'    =>'余额明细',
        'jshop_bill_aftersales' => '售后单',
        'jshop_bill_aftersales_images' => '商品图片关联',
        'jshop_bill_aftersales_items'  => '售后单明细表',
        'jshop_bill_delivery' =>'发货单',
        'jshop_bill_delivery_items' =>'发货单明细',
        'jshop_bill_lading' =>'提货单',
        'jshop_bill_payments' => '支付单',
        'jshop_bill_payments_rel' =>'支付单明细',
        'jshop_bill_refund' =>'退款单',
        'jshop_bill_reship' =>'退货单',
        'jshop_bill_reship_items' =>'退货单明细',

        'jshop_buy'  => '积分卖出',
        'jshop_deal' =>'匹配记录',
        'jshop_sale' =>'积分买入',

        'jshop_cart' =>'购物车记录',
        'jshop_goods_collection' =>'商品浏览记录',
        'jshop_goods_comment' =>'商品评价',
        'jshop_ietask' => '导入导出任务',
        'jshop_invoice_record' =>'发票信息记录',
        'jshop_message' =>'站内信',
        'jshop_order' =>'订单记录',
        'jshop_order_items' =>'订单信息',
        'jshop_order_log' =>'订单日志',

        'jshop_otayonii_sold' =>'未知',
        'jshop_print_express' =>'未知',
        'jshop_prize_record' =>'奖金记录',
        'jshop_shop_otayonii'=>'金豆/购物卷明细',

        'jshop_sms' => '短信记录',
        'jshop_user_point_log' =>'用户积分记录表',
        'jshop_user_tocash'    =>'提现记录',

        'jshop_user_transfer'  =>'兑换/转账记录',
        'jshop_user_upgrade'   =>'用户升级记录',

    ],

    'user' => [
        'sex' => [
            '1' => '男',
            '2' => '女',
            '3' => '待定',
        ],
        'status' => [
            '1' => '正常',
            '2' => '停用',
        ],
        'state' => [
            '1' => '登录',
            '2' => '退出'
        ]
    ],

    'bill_payments' => [
        'status' => [
            '1' => '待支付',
            '2' => '已支付',
            '3' => '其他'
        ],
        'type' => [
            '1' => '订单',
            '2' => '充值',
            '3'=> '线下支付',
        ]
    ],

    'bill_aftersales' => [
        'status' => [
            '1' => '未审核',
            '2' => '审核通过',
            '3' => '审核拒绝'
        ],
        'type' => [
            '1' => '只退款',
            '2' => '退款退货'
        ]
    ],

    'bill_refund' => [
        'status' => [
            '1' => '未退款',
            '2' => '已退款',
            '3' => '同意退款但原路退还失败',
            '4' => '拒绝'
        ],
        'type' => [
            '1' => '订单',
            '2' => '充值单',
            '5' => '表单订单',
            '6' => '表单支付',
        ]
    ],

    'bill_reship' => [
        'status' => [
            '1' => '待退货',
            '2' => '运输中',
            '3' => '已收退货'
        ]
    ],

    //订单
    'order' => [
        //订单来源
        'source' => [
            '1' => 'PC页面',
            '2' => 'H5页面',
            '3' => '微信小程序',
            '4' => '支付宝小程序',
            '5' => 'APP',
        ],
        //支付状态
        'pay_status' => [
            '1' => '未付款',
            '2' => '已付款',
            '3' => '部分付款',
            '4' => '部分退款',
            '5' => '已退款'
        ],
        //发货状态
        'ship_status' => [
            '1' => '未发货',
            '2' => '部分发货',
            '3' => '已发货',
            '4' => '部分退货',
            '5' => '已退货'
        ],
        //订单状态
        'status' => [
            '1' => '正常',
            '2' => '完成',
            '3' => '取消'
        ],
        //收货状态
        'confirm' => [
            '1' => '未确认收货',
            '2' => '已确认收货'
        ],
        'status_text' => [
            '1' => '待付款',
            '2' => '待发货',
            '3' => '待收货',
            '4' => '待评价',
            '5' => '已评价',
            '6' => '已完成',
            '7' => '已取消'
        ],
        //发票类型
        'tax_type' => [
            '1' => '不开发票',
            '2' => '个人发票',
            '3' => '公司发票'
        ],
        //用户性别
        'sex' => [
            '1' => '男',
            '2' => '女',
            '3' => '未知'
        ],
        //评价状态
        'is_comment' => [
            '1' => '未评价',
            '2' => '已评价'
        ],
        // 配送物流状态
        'logistics_state' => [
            '0' => '在途中',
            '1' => '已揽收',
            '2' => '疑难',
            '3' => '已签收'
        ]
    ],

    //优惠券
    'coupon' => [
        //优惠券状态
        'status' => [
            '1' => '启用',
            '2' => '禁用'
        ],
        //领取状态
        'is_used' => [
            '1' => '未使用',
            '2' => '已使用'
        ]
    ],

    //支付
    'payments' => [
        'status' => [
            '1' => '启用',
            '2' => '禁用'
        ],
        'is_online' => [
            '1' => '线上支付',
            '2' => '线下支付',
        ]
    ],

    //支付方式
    'payment_type' => [
        'wechatpay' => '微信支付',
        'alipay' => '支付宝支付',
        'offline' => '线下支付',
        'balancepay' => '余额支付',
        'coupon'     => '购物劵支付'
    ],

    //文章是否发布
    'article' => [
        'is_pub' => [
            '1' => '已发布',
            '2' => '未发布'
        ]
    ],

    //广告类型
    'carousel' => [
        'type' => [
            '1' => 'URL链接',
            '2' => '商品',
            '3' => '文章',
            '4' => '文章分类',
            '5' => '智能表单',
        ],
    ],

    //单位
    'danwei' => [
        'company' => [
            '1' => '日',
            '2' => '月',
            '3' => '面议',
        ],
    ],

    //是否急聘
    'ji' => [
        'worry' => [
            '1' => '急',
            '2' => '',
        ],
    ],

    //配送方式重量
    'ship_unit' => [
        '500'   => '500克',
        '1000'  => '1公斤',
        '1200'  => '1.2公斤',
        '2000'  => '2公斤',
        '5000'  => '5公斤',
        '10000' => '10公斤',
        '20000' => '20公斤',
        '50000' => '50公斤',
    ],

    //促销表
    'promotion' => [
        'exclusive' => [
            '1' => '否',
            '2' => '是'
        ],
        'status' => [
            '1' => '开启',
            '2' => '关闭'
        ]
    ],

    //评价
    'comment' => [
        '1' => '好评',
        '0' => '中评',
        '-1' => '差评'
    ],

    'message' => [
        'status' => [
            '1' => '未读',
            '2' => '已读'
        ]

    ],

    'sms' => [
        'status' => [
            '1' => '未使用',
            '2' => '已使用'
        ]

    ],

    'balance' => [
        'type' => [
            '1' => '消费',
            '2' => '退款',
            '3' => '充值',
            '4' => '提现',
            '5' => '佣金',
            '7' => '平台调整',

            '8' => '拨款',
            '9' => '扣款',
            '10'=> '推荐奖',
            '11'=> '购物增加',
            '12'=> '转账',
            '14'=> '极差奖',
            '16'=> '分红奖',
            '17'=> '直推分红奖',
            '18'=> '平级奖',
            '19'=> '分享奖',
            '15'=> '买卖',
            '20'=> '线下付款',
            '21'=> '销售提成',
            '22'=> '超越奖金',
            '23'=> '补货提成',
            '24'=> '三钻奖金',
        ],
    ],
    'prize' => [
        'type' => [
            '2'  => '极差奖',
            '3'  => '分红奖',
            '4'  => '直推分红奖',
            '5'  => '平级奖',
            '7'  => '销售提成',
            '8'  => '超越奖金',
            '9'  => '补货提成',
            '10' => '三钻奖金',
        ],
    ],

    'operation' => [
        'type' => [
            'a' => '方法',
            'c' => '控制器',
            'm' => '模块'
        ],
        'perm_type' => [
            '1' => '主体权限',
            '2' => '半主体权限',
            '3' => '附属权限'
        ]
    ],

    'user_point_log' => [
      'type' => [
          '1' => '签到',
          '2' => '消费送积分',
          '3' => '使用积分',
          '4' => '后台',
          '8' => '拨款',
          '9' => '扣款',
          '11'=> '购物增加',
          '12'=> '转账',
          '14'=> '兑换',
          '15'=> '买卖',
      ]
    ],

    'manage' => [
        'status' => [
            '1' => '正常',
            '2' => '停用',
        ]
    ],

    'bank_card' => [
        'type' => [
            '1' => '储蓄卡',
            '2' => '信用卡'
        ],
        'bank_logo_url' => 'https://apimg.alipay.com/combo.png?d=cashier&t='
    ],

    'user_tocash' => [
        'type' => [
            '1' => '待审核',
            '2' => '提现成功',
            '3' => '提现失败'
        ]
    ],
    'bean_sold' => [
        'type' => [
            '1' => '待审核',
            '2' => '提现成功',
            '3' => '提现失败'
        ]
    ],
    //提货单
    'bill_lading' => [
        'status' => [
            '1' => '未提货',
            '2' => '已提货'
        ]
    ],
    //发货单
    'bill_delivery' => [
        'status' => [
            '1' => '准备发货',
            '2' => '已发货',
            '3' => '已确认',
            '4' => '其它',
        ]
    ],
    //微信消息类型
    'weixin_message'=>[
        'type'=>[
            '1'=>'文本消息',
            '2'=>'图片消息',
            '3'=>'图文消息',
        ],
        'attention'=>[
            '1'=>'是',
            '2'=>'否',
        ],
        'default'=>[
            '1'=>'是',
            '2'=>'否',
        ],
        'enable'=>[
            '1'=>'否',
            '2'=>'是',
        ]

    ],
    'form' => [
        'type'            => [
            '1' => '订单',
            '2' => '付款码',
            '3' => '留言',
            '4' => '反馈',
            '5' => '登记',
            '6' => '调研',
        ],
        'field_type'      => [
            'radio'      => '单选',
            'checbox'    => '复选',
            'text'       => '文本框',
            'textarea'   => '文本域',
            'date'       => '日期',
            'time'       => '时间',
            'goods'      => '商品',
            'money'      => '金额',
            'password'   => '密码',
            'area'       => '省市区',
            'image'      => '图片',
            'coordinate' => '坐标',
        ],
        'validation_type' => [
            'string'  => '字符串',
            'number'  => '数字',
            'integer' => '整数',
            'price'   => '价格',
            'email'   => '邮箱',
            'mobile'   => '手机号',
        ],
        'head_type'       => [
            '1' => '图片',
            '2' => '轮播',
            '3' => '视频',
        ],
        'submit_status'=>[
            '1'=>'已处理',
            '2'=>'未处理',
        ],
        'submit_pay_status'=>[
            '1'=>'已支付',
            '2'=>'未支付',
        ],
    ]
];